       IDENTIFICATION DIVISION.
       PROGRAM-ID. CICSTEST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-PGM PIC X(8).
       PROCEDURE DIVISION.
       EXEC CICS LINK PROGRAM(WS-PGM) NOHANDLE END-EXEC.
       GOBACK.
