       IDENTIFICATION DIVISION.
       PROGRAM-ID. CICSTEST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 FLAG PIC X.
       01 WS-PGM PIC X(8).
       PROCEDURE DIVISION.
       IF FLAG = 'Y'
       MOVE 'PROGA' TO WS-PGM
       ELSE MOVE 'PROGB' TO WS-PGM
       END-IF.
       EXEC CICS LINK PROGRAM(WS-PGM) NOHANDLE END-EXEC.
       GOBACK.
