       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILETEST.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT F ASSIGN TO DYNAMIC X.
       DATA DIVISION.
       FILE SECTION.
       FD F.
       01 R PIC X(8).
       WORKING-STORAGE SECTION.
       01 X PIC X(8) VALUE 'CLIENTDD'.
       PROCEDURE DIVISION.
           OPEN INPUT F.
           READ F.
           CLOSE F.
           GOBACK.
