       IDENTIFICATION DIVISION.
       PROGRAM-ID. CICSTEST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-PGM PIC X(8).
       PROCEDURE DIVISION.
       MOVE 'PROGA' TO WS-PGM.
       EXEC CICS XCTL PROGRAM(WS-PGM) NOHANDLE END-EXEC.
       GOBACK.
