       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROBE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 PGM PIC X(8).
       01 FLAG PIC X.
       01 ODD PIC X SYNC.
       PROCEDURE DIVISION.
       MOVE "OLDPGM" TO PGM
       CALL PGM
       GOBACK.
