       IDENTIFICATION DIVISION.
       PROGRAM-ID. ROOTTEST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 FILLER.
          05 TARGET PIC X(8) VALUE 'PROGA001'.
       01 FLAG-TEXT PIC X.
       PROCEDURE DIVISION.
       IF FLAG-TEXT = 'Y'
           MOVE 'PROGB001' TO TARGET
       ELSE
           MOVE 'PROGC001' TO TARGET
       END-IF.
       CALL TARGET.
       GOBACK.
