       IDENTIFICATION DIVISION.
       PROGRAM-ID. ROOTTEST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 FILLER.
          05 TARGET PIC X(8) VALUE 'PROGA001'.
       01 SOURCE-TEXT PIC X(8) VALUE 'PROGB001'.
       PROCEDURE DIVISION.
       MOVE SOURCE-TEXT TO TARGET.
       CALL TARGET.
       GOBACK.
