       IDENTIFICATION DIVISION.
       PROGRAM-ID. ROOTTEST.
       PROCEDURE DIVISION.
       DISPLAY "A"
      -    "B".
           CALL 'AFTER001'.
           GOBACK.
