       IDENTIFICATION DIVISION.
       PROGRAM-ID. ROOTTEST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NAMED-ROOT.
          05 TARGET PIC X(8) VALUE 'PROGA001'.
       PROCEDURE DIVISION.
       MOVE 'PROGB001' TO TARGET.
       CALL TARGET.
       GOBACK.
