       IDENTIFICATION DIVISION.
       PROGRAM-ID. ROOTTEST.
       PROCEDURE DIVISION.
       DISP
      -    LAY 'A' 'B'.
           CALL 'AFTER001'.
           GOBACK.
