       IDENTIFICATION DIVISION.
       PROGRAM-ID. ROOTTEST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 FILLER.
          05 GROUP-TARGET.
             10 FILLER PIC X(4).
             10 SUFFIX-TEXT PIC X(4).
       PROCEDURE DIVISION.
       MOVE 'A001' TO SUFFIX-TEXT.
       CALL GROUP-TARGET.
       GOBACK.
