       IDENTIFICATION DIVISION.
       PROGRAM-ID. ROOTTEST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 FILLER.
          05 FILLER PIC X(4).
          05 TARGET PIC X(8) VALUE 'PROGA001'.
          05 OTHER-TEXT PIC X(4).
       PROCEDURE DIVISION.
       MOVE 'TEST' TO OTHER-TEXT.
       CALL TARGET.
       GOBACK.
