       IDENTIFICATION DIVISION.
       PROGRAM-ID. ROOTTEST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 MESSAGE-TEXT PIC X VALUE 'A'.
       PROCEDURE DIVISION.
       DISPLAY MESSAGE-TEXT
      -    'B'.
           CALL 'AFTER001'.
           GOBACK.
