       IDENTIFICATION DIVISION.
       PROGRAM-ID. PARENT.
       PROCEDURE DIVISION.
       CALL 'PARENTPG'.
       GOBACK.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. CHILD.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 FN PIC X(8).
       01 SYS PIC X(4).
       PROCEDURE DIVISION.
       MOVE 'ACCOUNTS' TO FN.
       MOVE 'R001' TO SYS.
       EXEC CICS ENDBR FILE(FN) SYSID(SYS)
       NOHANDLE END-EXEC.
       CALL 'CHILDPG'.
       GOBACK.
       END PROGRAM CHILD.
       END PROGRAM PARENT.
