       IDENTIFICATION DIVISION.
       PROGRAM-ID. COPY-A.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT A ASSIGN TO SAMEEXT.
       DATA DIVISION.
       FILE SECTION.
       COPY FDW0 REPLACING FILE-TEMPLATE BY A
        RECORD-TEMPLATE BY RA.
       WORKING-STORAGE SECTION.
       
       PROCEDURE DIVISION.
       WRITE RA.
       CALL 'COPYA'.
       GOBACK.
       END PROGRAM COPY-A.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. COPY-B.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT B ASSIGN TO SAMEEXT.
       DATA DIVISION.
       FILE SECTION.
       COPY FDW0 REPLACING FILE-TEMPLATE BY B
        RECORD-TEMPLATE BY RB.
       WORKING-STORAGE SECTION.
       
       PROCEDURE DIVISION.
       WRITE RB.
       CALL 'COPYB'.
       GOBACK.
       END PROGRAM COPY-B.
