       IDENTIFICATION DIVISION.
       PROGRAM-ID. ONE.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT F ASSIGN TO COMMONDD.
       DATA DIVISION.
       FILE SECTION.
       FD F IS EXTERNAL.
       01 R PIC X(8).
       WORKING-STORAGE SECTION.
       
       PROCEDURE DIVISION.
       OPEN INPUT F.
       CALL 'ONECALL'.
       GOBACK.
       END PROGRAM ONE.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. TWO.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT F ASSIGN TO COMMONDD.
       DATA DIVISION.
       FILE SECTION.
       FD F IS EXTERNAL.
       01 R PIC X(8).
       WORKING-STORAGE SECTION.
       
       PROCEDURE DIVISION.
       DISPLAY 'PARTIAL'.
       OPEN INPUT F.
       CALL 'TWOCALL'.
       GOBACK.
       END PROGRAM TWO.
