       IDENTIFICATION DIVISION.
       PROGRAM-ID. OWNER.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT F ASSIGN TO GLOBALDD.
       DATA DIVISION.
       FILE SECTION.
       FD F IS GLOBAL.
       01 R PIC X(8).
       WORKING-STORAGE SECTION.
       
       PROCEDURE DIVISION.
       CONTINUE.
       GOBACK.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. USER.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       
       DATA DIVISION.
       FILE SECTION.
       
       WORKING-STORAGE SECTION.
       01 PGM PIC X(8).
       PROCEDURE DIVISION.
       MOVE 'KEEP' TO PGM.
       READ F.
       CALL PGM.
       GOBACK.
       END PROGRAM USER.
       END PROGRAM OWNER.
