       IDENTIFICATION DIVISION.
       PROGRAM-ID. GOOD.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT F ASSIGN TO GOODDD.
       DATA DIVISION.
       FILE SECTION.
       FD F.
       01 R PIC X(8).
       WORKING-STORAGE SECTION.
       
       PROCEDURE DIVISION.
       OPEN INPUT F.
       CALL 'GOODCALL'.
       GOBACK.
       END PROGRAM GOOD.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. GAP.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT F ASSIGN TO GAPDD.
       DATA DIVISION.
       FILE SECTION.
       FD F.
       01 R PIC X(8).
       WORKING-STORAGE SECTION.
       COPY SECRET.
       PROCEDURE DIVISION.
       OPEN INPUT F.
       CALL 'GAPCALL'.
       GOBACK.
       END PROGRAM GAP.
