       IDENTIFICATION DIVISION.
       PROGRAM-ID. PARENT.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT SHARED-F ASSIGN TO PARENTDD.
       SELECT PRIVATE-F ASSIGN TO PRIVDD.
       DATA DIVISION.
       FILE SECTION.
       FD SHARED-F IS GLOBAL.
       01 GLOBAL-REC PIC X(8).
       FD PRIVATE-F.
       01 PRIVATE-REC PIC X(8).
       WORKING-STORAGE SECTION.
       01 GLOBAL-NAME IS GLOBAL PIC X(8).
       PROCEDURE DIVISION.
       CALL 'PARENTPG'.
       GOBACK.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. CHILD.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       
       DATA DIVISION.
       FILE SECTION.
       
       WORKING-STORAGE SECTION.
       
       PROCEDURE DIVISION.
       OPEN INPUT SHARED-F.
       WRITE GLOBAL-REC.
       CALL GLOBAL-NAME.
       EXEC CICS LINK PROGRAM('CHILDLNK') NOHANDLE END-EXEC.
       GOBACK.
       END PROGRAM CHILD.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. SHADOW.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT SHARED-F ASSIGN TO CHILDDD.
       DATA DIVISION.
       FILE SECTION.
       FD SHARED-F.
       01 CHILD-REC PIC X(8).
       WORKING-STORAGE SECTION.
       
       PROCEDURE DIVISION.
       OPEN OUTPUT SHARED-F.
       CALL 'SHADOWPG'.
       GOBACK.
       END PROGRAM SHADOW.
       END PROGRAM PARENT.
