       IDENTIFICATION DIVISION.
       PROGRAM-ID. QUALIFIED.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT F ASSIGN TO FIRSTDD.
       SELECT G ASSIGN TO SECONDDD.
       DATA DIVISION.
       FILE SECTION.
       FD F.
       01 R PIC X(8).
       FD G.
       01 R PIC X(8).
       WORKING-STORAGE SECTION.
       
       PROCEDURE DIVISION.
       WRITE R OF F.
       WRITE R.
       CALL 'KEEP'.
       GOBACK.
       END PROGRAM QUALIFIED.
