       IDENTIFICATION DIVISION.
       PROGRAM-ID. PMT-COPY.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 SRC-GRP.
        05 PREFIX PIC X(3).
        05 SUFFIX PIC X(5) SYNC.
       01 DST-GRP.
        05 LEFT-PART PIC X(4).
        05 RIGHT-PART PIC X(4).
       01 PGM REDEFINES DST-GRP PIC X(8).
       PROCEDURE DIVISION.
       MOVE "PROGA001" TO SRC-GRP
       MOVE SRC-GRP TO DST-GRP
       MOVE "OTHER999" TO SRC-GRP
       CALL "EXTERNAL"
       CALL PGM
       GOBACK.
