       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALLER.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-A PIC X(8).
       01 WS-PGM PIC X(8).
       PROCEDURE DIVISION.
           MOVE 'OLDPROG' TO WS-PGM.
           MOVE 'PROGA' TO WS-A.
           MOVE WS-A TO WS-PGM.
           CALL WS-PGM.
           GOBACK.
