       IDENTIFICATION DIVISION.
       PROGRAM-ID. AUXIO.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT S ASSIGN TO SORTWK.
       I-O-CONTROL. RERUN ON CHKPT.
       DATA DIVISION.
       FILE SECTION.
       SD S.
       01 SR PIC X.
       WORKING-STORAGE SECTION.
       
       PROCEDURE DIVISION.
       GOBACK.
       END PROGRAM AUXIO.
