       IDENTIFICATION DIVISION.
       PROGRAM-ID. AUXIO.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT S ASSIGN TO SORTWK.
       SELECT A ASSIGN TO INPUTDD.
       SELECT B ASSIGN TO OUTPUTDD.
       I-O-CONTROL. RERUN ON CHKPT.
       DATA DIVISION.
       FILE SECTION.
       SD S.
       01 SR.
        02 SK PIC X(8).
       FD A.
       01 AR PIC X(8).
       FD B.
       01 BR PIC X(8).
       WORKING-STORAGE SECTION.
       01 SAFE-NAME PIC X(8) VALUE 'SAFE0001'.
       PROCEDURE DIVISION.
       SORT S ON ASCENDING KEY SK USING A GIVING B.
       CALL SAFE-NAME.
       GOBACK.
       END PROGRAM AUXIO.
