       IDENTIFICATION DIVISION.
       PROGRAM-ID. AUXIO.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT F ASSIGN TO INPUTDD.
       I-O-CONTROL. RERUN ON CHKPT EVERY 100 RECORDS OF F.
       DATA DIVISION.
       FILE SECTION.
       FD F.
       01 R PIC X.
       WORKING-STORAGE SECTION.
       01 SAFE-NAME PIC X(8) VALUE 'SAFE0001'.
       PROCEDURE DIVISION.
       OPEN INPUT F.
       READ F.
       CLOSE F.
       CALL SAFE-NAME.
       GOBACK.
       END PROGRAM AUXIO.
