       IDENTIFICATION DIVISION.
       PROGRAM-ID. AUXIO.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT F ASSIGN TO FIRSTDD
        PADDING CHARACTER IS SPACE RECORD DELIMITER STANDARD-1.
       SELECT G ASSIGN TO SECONDDD.
       I-O-CONTROL. MULTIPLE FILE TAPE F POSITION 1 G POSITION 2.
       DATA DIVISION.
       FILE SECTION.
       FD F LABEL RECORDS STANDARD
        DATA RECORDS ARE COMMENT-NAME.
       01 R PIC X.
       FD G.
       01 GR PIC X.
       WORKING-STORAGE SECTION.
       
       PROCEDURE DIVISION.
       CALL 'SAFE0001'.
       GOBACK.
       END PROGRAM AUXIO.
