       IDENTIFICATION DIVISION.
       PROGRAM-ID. AUXIO.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT F ASSIGN TO OUTPUTDD.
       DATA DIVISION.
       FILE SECTION.
       FD F LINAGE PAGE-LINES.
       01 R PIC X(8).
       WORKING-STORAGE SECTION.
       01 PAGE-LINES PIC 99 VALUE 60.
       01 SAFE-NAME PIC X(8) VALUE 'SAFE0001'.
       PROCEDURE DIVISION.
       OPEN OUTPUT F.
       WRITE R AFTER ADVANCING PAGE.
       CALL SAFE-NAME.
       GOBACK.
       END PROGRAM AUXIO.
