       IDENTIFICATION DIVISION.
       PROGRAM-ID. AUXIO.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT F ASSIGN TO OUTPUTDD.
       DATA DIVISION.
       FILE SECTION.
       FD F LINAGE 60.
       01 R PIC X(8).
       WORKING-STORAGE SECTION.
       01 TARGET-NAME PIC X(8) VALUE 'STALE001'.
       01 SAFE-NAME PIC X(8) VALUE 'SAFE0001'.
       PROCEDURE DIVISION.
       OPEN OUTPUT F.
       WRITE R AFTER ADVANCING 1 LINE.
       MOVE LINAGE-COUNTER OF F TO TARGET-NAME.
       CALL TARGET-NAME.
       CALL SAFE-NAME.
       GOBACK.
       END PROGRAM AUXIO.
