       IDENTIFICATION DIVISION.
       PROGRAM-ID. AUXIO.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT F ASSIGN TO INPUTDD ORGANIZATION INDEXED
        RECORD KEY K PASSWORD SECRET.
       DATA DIVISION.
       FILE SECTION.
       FD F.
       01 R.
        02 K PIC X.
       WORKING-STORAGE SECTION.
       01 SECRET PIC X(8) VALUE 'SAFE0001'.
       PROCEDURE DIVISION.
       OPEN INPUT F.
       CALL SECRET.
       GOBACK.
       END PROGRAM AUXIO.
