       IDENTIFICATION DIVISION.
       PROGRAM-ID. AUXIO.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT F ASSIGN TO FIRSTDD ORGANIZATION INDEXED
        RECORD KEY FK.
       SELECT G ASSIGN TO SECONDDD ORGANIZATION INDEXED
        RECORD KEY GK.
       I-O-CONTROL. SAME AREA FOR F G.
       DATA DIVISION.
       FILE SECTION.
       FD F.
       01 FR.
        02 FK PIC X(8).
       FD G.
       01 GR.
        02 GK PIC X(8).
       WORKING-STORAGE SECTION.
       01 SAFE-NAME PIC X(8) VALUE 'SAFE0001'.
       PROCEDURE DIVISION.
       MOVE 'STALE001' TO GR.
       READ F.
       CALL GR.
       CALL SAFE-NAME.
       GOBACK.
       END PROGRAM AUXIO.
