       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILECTRL.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT F ASSIGN TO INDD FILE STATUS FS.
       DATA DIVISION.
       FILE SECTION.
       FD F LINAGE IS 60 LINES.
       01 REC PIC X(8).
       WORKING-STORAGE SECTION.
       01 FS PIC XX.
       01 DEST PIC X(8).
       PROCEDURE DIVISION.
       WRITE REC BEFORE ADVANCING PAGE
        AT EOP CALL 'PAGEPGM'
        NOT AT EOP CALL 'NOTPAGE' END-WRITE.
       CALL 'AFTER'.
       GOBACK.
