       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILECTRL.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT F ASSIGN TO INDD FILE STATUS FS.
       DATA DIVISION.
       FILE SECTION.
       FD F.
       01 REC PIC X(8).
       WORKING-STORAGE SECTION.
       01 FS PIC XX.
       01 DEST PIC X(8).
       PROCEDURE DIVISION.
       DECLARATIVES.
       MODE-ERROR SECTION.
       USE AFTER ERROR PROCEDURE ON INPUT.
       MODE-PARA.
       CALL 'MODEPGM'.
       END DECLARATIVES.
       MAIN-SECTION SECTION.
       MAIN-PARA.
       OPEN INPUT F.
       READ F
        AT END IF FS = '10' CALL 'EOFPGM'
        ELSE CALL 'OTHERPGM' END-IF
        NOT AT END CALL 'NOTEOF' END-READ.
       CALL 'AFTER'.
       GOBACK.
