       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILECTRL.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT F ASSIGN TO INDD FILE STATUS FS.
       DATA DIVISION.
       FILE SECTION.
       FD F.
       01 REC PIC X(8).
       WORKING-STORAGE SECTION.
       01 FS PIC XX.
       01 DEST PIC X(8).
       PROCEDURE DIVISION.
       DECLARATIVES.
       FILE-ERROR SECTION.
       USE AFTER ERROR PROCEDURE ON F.
       ERROR-PARA.
       READ F AT END CALL 'INNEREND' END-READ.
       CALL 'USETAIL'.
       END DECLARATIVES.
       MAIN-SECTION SECTION.
       MAIN-PARA.
       READ F NOT AT END
        READ F AT END CALL 'NESTEOF' END-READ END-READ.
       CALL 'AFTER'.
       GOBACK.
