       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILECTRL.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT F ASSIGN TO INDD ORGANIZATION IS INDEXED
        ACCESS IS DYNAMIC RECORD KEY REC FILE STATUS FS.
       DATA DIVISION.
       FILE SECTION.
       FD F.
       01 REC PIC X(8).
       WORKING-STORAGE SECTION.
       01 FS PIC XX.
       01 DEST PIC X(8).
       PROCEDURE DIVISION.
       DECLARATIVES.
       FILE-ERROR SECTION.
       USE AFTER ERROR PROCEDURE ON F.
       ERROR-PARA.
       CALL 'USEFILE'.
       END DECLARATIVES.
       MAIN-SECTION SECTION.
       MAIN-PARA.
       READ F INTO DEST KEY REC
        INVALID KEY CALL 'MISS'
        NOT INVALID KEY CALL 'GOOD' END-READ.
       CALL 'AFTER'.
       GOBACK.
