       IDENTIFICATION DIVISION.
       PROGRAM-ID. SORTIO.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT S ASSIGN TO SORTWK.
       SELECT A ASSIGN TO INA.
       SELECT B ASSIGN TO INB.
       SELECT C ASSIGN TO OUTC.
       DATA DIVISION.
       FILE SECTION.
       SD S.
       01 SR.
        02 SK PIC X(4).
        02 SK2 PIC X(4).
       FD A.
       01 AR PIC X(8).
       FD B.
       01 BR PIC X(8).
       FD C.
       01 CR PIC X(8).
       WORKING-STORAGE SECTION.
       01 BUF PIC X(8).
       PROCEDURE DIVISION.
       MAIN.
       SORT S ON ASCENDING KEY SK
        INPUT PROCEDURE IN-FIRST THRU IN-LAST
        OUTPUT PROCEDURE OUT-FIRST THRU OUT-LAST.
       CALL 'AFTER'.
       GOBACK.
       IN-FIRST.
       CALL 'INPGM'.
       RELEASE SR FROM BUF.
       IN-LAST.
       CALL 'INTAIL'.
       OUT-FIRST.
       RETURN S INTO BUF AT END CALL 'EOFPGM' END-RETURN.
       OUT-LAST.
       CALL 'OUTTAIL'.
       END PROGRAM SORTIO.
