       IDENTIFICATION DIVISION.
       PROGRAM-ID. TABTEST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TAB.
        02 T OCCURS 3 TIMES ASCENDING KEY K.
         03 K PIC X.
       PROCEDURE DIVISION.
       SORT T ASCENDING KEY K.
       GOBACK.
       END PROGRAM TABTEST.
