       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILETEST.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT F ASSIGN TO CLIENTDD.
           SELECT G ASSIGN TO OTHERDD.
       DATA DIVISION.
       FILE SECTION.
       FD F.
       01 R PIC X(8).
       FD G.
       01 S PIC X(8).
       PROCEDURE DIVISION.
           EXEC CICS HANDLE ABEND LABEL(RECOVER) END-EXEC.
           OPEN INPUT F OUTPUT G.
           EXEC CICS ABEND ABCODE('FAIL') END-EXEC.
           CLOSE F G.
           GOBACK.
       RECOVER.
           CALL 'RECOVER'.
           GOBACK.
