       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILETEST.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT F ASSIGN TO CLIENTDD
        ORGANIZATION INDEXED ACCESS DYNAMIC RECORD KEY K.
       SELECT G ASSIGN TO OTHERDD.
       DATA DIVISION.
       FILE SECTION.
       FD F.
       01 R.
        02 K PIC X(8).
       FD G.
       01 OTHER-R PIC X(8).
       WORKING-STORAGE SECTION.
       01 BUF PIC X(8).
       PROCEDURE DIVISION.
       OPEN I-O F.
       READ F KEY K.
       WRITE R FROM OTHER-R.
       REWRITE R FROM BUF.
       DELETE F RECORD.
       START F KEY GREATER THAN K.
       CLOSE F.
       GOBACK.
