       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILEPROBE.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT F ASSIGN TO CLIENTDD.
       DATA DIVISION.
       FILE SECTION.
       FD F.
       01 FR PIC X(8).
       PROCEDURE DIVISION.
       OPEN INPUT F.
       CLOSE F.
       GOBACK.
