       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILEPROBE.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT F ASSIGN TO CLIENTDD FILE STATUS FS.
       SELECT G ASSIGN TO OTHERDD FILE STATUS GS.
       DATA DIVISION.
       FILE SECTION.
       FD F.
       01 FR PIC X(8).
       FD G.
       01 GR PIC X(8).
       WORKING-STORAGE SECTION.
       01 FS PIC XX.
       01 TARGET-NAME PIC X(8) VALUE 'KEEP0001'.
       01 STATUS-AREA REDEFINES TARGET-NAME.
          05 GS PIC 99.
          05 FILLER PIC X(6).
       PROCEDURE DIVISION.
       OPEN INPUT F OUTPUT G.
       CALL TARGET-NAME.
       CLOSE F G.
       GOBACK.
