       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILEPROBE.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT F ASSIGN TO CLIENTDD FILE STATUS FS.
       SELECT G ASSIGN TO OTHERDD FILE STATUS GS.
       DATA DIVISION.
       FILE SECTION.
       FD F.
       01 FR PIC X(8).
       FD G.
       01 GR PIC X(8).
       WORKING-STORAGE SECTION.
       01 FS PIC XX.
       01 GS PIC XX.
       PROCEDURE DIVISION.
       OPEN INPUT F OUTPUT G.
       CLOSE F G.
       GOBACK.
