       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILEPROBE.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT F ASSIGN TO CLIENTDD.
       SELECT G ASSIGN TO OTHERDD.
       SELECT H ASSIGN TO THIRDDD.
       DATA DIVISION.
       FILE SECTION.
       FD F.
       01 FR PIC X(8).
       FD G.
       01 GR PIC X(8).
       FD H.
       01 HR PIC X(8).
       PROCEDURE DIVISION.
       OPEN INPUT F OUTPUT G EXTEND H.
       CLOSE F G H.
       GOBACK.
