       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILEMEM.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT F ASSIGN TO CLIENTDD FILE STATUS IO-STATUS.
       DATA DIVISION.
       FILE SECTION.
       FD F.
       01 REC PIC X(8).
       WORKING-STORAGE SECTION.
       01 SAFE-PGM PIC X(8) VALUE 'SAFE'.
       01 DEST PIC X(8).
       01 IO-STATUS PIC XX.
       PROCEDURE DIVISION.
       MOVE 'OLDINTO' TO DEST.
       READ F INTO DEST.
       CALL DEST.
       CALL SAFE-PGM.
       GOBACK.
