       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILEMEM.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT F ASSIGN TO CLIENTDD.
       DATA DIVISION.
       FILE SECTION.
       FD F.
       01 REC PIC X(8).
       01 ALIAS-REC PIC X(8).
       WORKING-STORAGE SECTION.
       01 SAFE-PGM PIC X(8) VALUE 'SAFE'.
       PROCEDURE DIVISION.
       MOVE 'OLD' TO REC.
       READ F.
       CALL ALIAS-REC.
       GOBACK.
