       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILEMEM.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT F ASSIGN TO CLIENTDD.
       SELECT G ASSIGN TO OTHERDD.
       DATA DIVISION.
       FILE SECTION.
       FD F.
       01 REC PIC X(8).
       FD G.
       01 SOURCE-REC PIC X(8).
       WORKING-STORAGE SECTION.
       01 SAFE-PGM PIC X(8) VALUE 'SAFE'.
       PROCEDURE DIVISION.
       MOVE 'SOURCE' TO SOURCE-REC.
       REWRITE REC FROM SOURCE-REC.
       CALL SOURCE-REC.
       CALL SAFE-PGM.
       GOBACK.
