       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILEMEM.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT F ASSIGN TO CLIENTDD.
       DATA DIVISION.
       FILE SECTION.
       FD F.
       01 REC PIC X(8).
       WORKING-STORAGE SECTION.
       01 SAFE-PGM PIC X(8) VALUE 'SAFE'.
       PROCEDURE DIVISION.
       WRITE REC FROM MISSING.
       CALL SAFE-PGM.
       GOBACK.
