       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILETEST.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT F ASSIGN TO CLIENTDD
        ORGANIZATION INDEXED ACCESS DYNAMIC RECORD KEY K.
       DATA DIVISION.
       FILE SECTION.
       FD F.
       01 R.
        02 K PIC X(8).
       WORKING-STORAGE SECTION.
       01 BUF PIC X(8).
       PROCEDURE DIVISION.
       READ F NEXT RECORD INTO BUF
        AT END IF BUF = 'A' CALL 'EOF' END-IF
        NOT AT END MOVE 'B' TO BUF END-READ.
       WRITE R FROM BUF
        INVALID KEY CALL 'BAD'
        NOT INVALID KEY CALL 'OK' END-WRITE.
       GOBACK.
