       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILETEST.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT F ASSIGN TO CLIENTDD
        ORGANIZATION INDEXED ACCESS DYNAMIC RECORD KEY K.
       DATA DIVISION.
       FILE SECTION.
       FD F.
       01 R.
        02 K PIC X(8).
       WORKING-STORAGE SECTION.
       01 BUF PIC X(8).
       PROCEDURE DIVISION.
       START F KEY NOT LESS THAN K.
       GOBACK.
