       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROBE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 FAMILY.
        05 PGM PIC X(8).
        05 ODD PIC X SYNC.
       01 FLAG PIC X.
       PROCEDURE DIVISION.
       MOVE "OLDPGM" TO PGM
       CALL PGM
       GOBACK.
